#+TITLE: Maintenance ORG file for pajengr package
#+AUTHOR: Lucas Mello Schnorr
#+STARTUP: overview indent
#+TAGS: noexport(n) deprecated(d)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

The package has been created with Rcpp's version of =package.skeleton=,
by running the following code. This is no longer necessary because the
package has already been created and modified. The contents of the
pajengr directory created by the =Rcpp.package.skeleton= have been
copied to the root directory of this repository.

#+begin_src R :results output :session :exports both
library(Rcpp);
Rcpp.package.skeleton("pajengr");
#+end_src

#+RESULTS:
#+begin_example
Creating directories ...
Creating DESCRIPTION ...
Creating NAMESPACE ...
Creating Read-and-delete-me ...
Saving functions and data ...
Making help files ...
Done.
Further steps are described in './pajengr/Read-and-delete-me'.

Adding Rcpp settings
 >> added Imports: Rcpp
 >> added LinkingTo: Rcpp
 >> added useDynLib directive to NAMESPACE
 >> added importFrom(Rcpp, evalCpp) directive to NAMESPACE
 >> added example src file using Rcpp attributes
 >> added Rd file for rcpp_hello_world
 >> compiled Rcpp attributes
#+end_example

Every time some new function is exported, we need to recompile the
attributes in the following way, so our R API gets updated.

#+begin_src R :results output :exports both
library(Rcpp);
unlink("src/RcppExports.cpp")
compileAttributes(".");
#+end_src

#+RESULTS:

The package can be checked and installed the following way (for
development purposes only). Please note that the standard installation
procedure [[./README.org][has already been described in the README file]]. Note that the
following commands should be executed considering the existence of a
=pajengr= directory with the contents of this repository. If you are
within the aforementioned directory, replace pajengr by the dot.

#+begin_src shell :results output
#R CMD check .
R CMD INSTALL .
#+end_src

#+RESULTS:
#+begin_example
-- The C compiler identification is GNU 10.2.1
-- The CXX compiler identification is GNU 10.2.1
-- Detecting C compiler ABI info
-- Detecting C compiler ABI info - done
-- Check for working C compiler: /usr/bin/cc - skipped
-- Detecting C compile features
-- Detecting C compile features - done
-- Detecting CXX compiler ABI info
-- Detecting CXX compiler ABI info - done
-- Check for working CXX compiler: /usr/bin/c++ - skipped
-- Detecting CXX compile features
-- Detecting CXX compile features - done
-- Found BISON: /usr/bin/bison (found version "3.7.5") 
-- Configuring done
-- Generating done
-- Build files have been written to: /home/schnorr/dev/pajengr/src/pajeng.build
/usr/bin/cmake -S/home/schnorr/dev/pajengr/src/pajeng -B/home/schnorr/dev/pajengr/src/pajeng.build --check-build-system CMakeFiles/Makefile.cmake 0
/usr/bin/cmake -E cmake_progress_start /home/schnorr/dev/pajengr/src/pajeng.build/CMakeFiles /home/schnorr/dev/pajengr/src/pajeng.build//CMakeFiles/progress.marks
make  -f CMakeFiles/Makefile2 all
make[1]: Entering directory '/home/schnorr/dev/pajengr/src/pajeng.build'
make  -f src/libpaje/CMakeFiles/paje_library_static.dir/build.make src/libpaje/CMakeFiles/paje_library_static.dir/depend
make[2]: Entering directory '/home/schnorr/dev/pajengr/src/pajeng.build'
[  3%] [BISON][parser] Building parser with bison 3.7.5
cd /home/schnorr/dev/pajengr/src/pajeng/src/libpaje && /usr/bin/bison -d -o /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje/parser.cc parser.y
[  7%] [FLEX][scanner] Building scanner with flex 2.6.4
cd /home/schnorr/dev/pajengr/src/pajeng/src/libpaje && /usr/bin/flex -F -o/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje/lexer.cc scanner.l
cd /home/schnorr/dev/pajengr/src/pajeng.build && /usr/bin/cmake -E cmake_depends "Unix Makefiles" /home/schnorr/dev/pajengr/src/pajeng /home/schnorr/dev/pajengr/src/pajeng/src/libpaje /home/schnorr/dev/pajengr/src/pajeng.build /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje/CMakeFiles/paje_library_static.dir/DependInfo.cmake --color=
Dependee "/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje/CMakeFiles/CMakeDirectoryInformation.cmake" is newer than depender "/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje/CMakeFiles/paje_library_static.dir/depend.internal".
Scanning dependencies of target paje_library_static
make[2]: Leaving directory '/home/schnorr/dev/pajengr/src/pajeng.build'
make  -f src/libpaje/CMakeFiles/paje_library_static.dir/build.make src/libpaje/CMakeFiles/paje_library_static.dir/build
make[2]: Entering directory '/home/schnorr/dev/pajengr/src/pajeng.build'
[ 11%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeEventDefinition.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeEventDefinition.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeEventDefinition.cc
[ 15%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeTraceEvent.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeTraceEvent.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeTraceEvent.cc
[ 19%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeEvent.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeEvent.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeEvent.cc
[ 23%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeData.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeData.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeData.cc
[ 26%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeFileReader.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeFileReader.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeFileReader.cc
[ 30%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeObject.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeObject.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeObject.cc
[ 34%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeEventDecoder.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeEventDecoder.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeEventDecoder.cc
[ 38%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeSimulator.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeSimulator.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeSimulator.cc
[ 42%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeProbabilisticSimulator.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeProbabilisticSimulator.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeProbabilisticSimulator.cc
[ 46%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeSimulator+Queries.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeSimulator+Queries.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeSimulator+Queries.cc
[ 50%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeSimulator+Commands.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeSimulator+Commands.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeSimulator+Commands.cc
[ 53%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeComponent.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeComponent.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeComponent.cc
[ 57%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeType.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeType.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeType.cc
[ 61%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeValue.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeValue.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeValue.cc
[ 65%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeEntity.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeEntity.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeEntity.cc
[ 69%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeContainer.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeContainer.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeContainer.cc
[ 73%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeColor.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeColor.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeColor.cc
[ 76%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeException.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeException.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeException.cc
[ 80%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeDefinitions.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeDefinitions.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeDefinitions.cc
[ 84%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/lexer.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/lexer.cc.o -c /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje/lexer.cc
[ 88%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/parser.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/parser.cc.o -c /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje/parser.cc
[ 92%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeFlexReader.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeFlexReader.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeFlexReader.cc
[ 96%] Building CXX object src/libpaje/CMakeFiles/paje_library_static.dir/PajeUnity.cc.o
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/c++  -I/home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje -I/home/schnorr/dev/pajengr/src/pajeng/src/libpaje -fPIC -std=c++11 -O3 -DNDEBUG -o CMakeFiles/paje_library_static.dir/PajeUnity.cc.o -c /home/schnorr/dev/pajengr/src/pajeng/src/libpaje/PajeUnity.cc
[100%] Linking CXX static library libpaje.a
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/cmake -P CMakeFiles/paje_library_static.dir/cmake_clean_target.cmake
cd /home/schnorr/dev/pajengr/src/pajeng.build/src/libpaje && /usr/bin/cmake -E cmake_link_script CMakeFiles/paje_library_static.dir/link.txt --verbose=1
/usr/bin/ar qc libpaje.a CMakeFiles/paje_library_static.dir/PajeEventDefinition.cc.o CMakeFiles/paje_library_static.dir/PajeTraceEvent.cc.o CMakeFiles/paje_library_static.dir/PajeEvent.cc.o CMakeFiles/paje_library_static.dir/PajeData.cc.o CMakeFiles/paje_library_static.dir/PajeFileReader.cc.o CMakeFiles/paje_library_static.dir/PajeObject.cc.o CMakeFiles/paje_library_static.dir/PajeEventDecoder.cc.o CMakeFiles/paje_library_static.dir/PajeSimulator.cc.o CMakeFiles/paje_library_static.dir/PajeProbabilisticSimulator.cc.o CMakeFiles/paje_library_static.dir/PajeSimulator+Queries.cc.o CMakeFiles/paje_library_static.dir/PajeSimulator+Commands.cc.o CMakeFiles/paje_library_static.dir/PajeComponent.cc.o CMakeFiles/paje_library_static.dir/PajeType.cc.o CMakeFiles/paje_library_static.dir/PajeValue.cc.o CMakeFiles/paje_library_static.dir/PajeEntity.cc.o CMakeFiles/paje_library_static.dir/PajeContainer.cc.o CMakeFiles/paje_library_static.dir/PajeColor.cc.o CMakeFiles/paje_library_static.dir/PajeException.cc.o CMakeFiles/paje_library_static.dir/PajeDefinitions.cc.o CMakeFiles/paje_library_static.dir/lexer.cc.o CMakeFiles/paje_library_static.dir/parser.cc.o CMakeFiles/paje_library_static.dir/PajeFlexReader.cc.o CMakeFiles/paje_library_static.dir/PajeUnity.cc.o
/usr/bin/ranlib libpaje.a
make[2]: Leaving directory '/home/schnorr/dev/pajengr/src/pajeng.build'
[100%] Built target paje_library_static
make[1]: Leaving directory '/home/schnorr/dev/pajengr/src/pajeng.build'
/usr/bin/cmake -E cmake_progress_start /home/schnorr/dev/pajengr/src/pajeng.build/CMakeFiles 0
g++ -std=gnu++11 -I"/usr/share/R/include" -DNDEBUG -fPIC -Ipajeng/src/libpaje/ -I'/home/schnorr/R/x86_64-pc-linux-gnu-library/4.0/Rcpp/include'    -fpic  -g -O2 -ffile-prefix-map=/build/r-base-XqSJAD/r-base-4.0.4=. -fstack-protector-strong -Wformat -Werror=format-security -Wdate-time -D_FORTIFY_SOURCE=2 -g  -c pj_events.cpp -o pj_events.o
g++ -std=gnu++11 -I"/usr/share/R/include" -DNDEBUG -fPIC -Ipajeng/src/libpaje/ -I'/home/schnorr/R/x86_64-pc-linux-gnu-library/4.0/Rcpp/include'    -fpic  -g -O2 -ffile-prefix-map=/build/r-base-XqSJAD/r-base-4.0.4=. -fstack-protector-strong -Wformat -Werror=format-security -Wdate-time -D_FORTIFY_SOURCE=2 -g  -c pj_links.cpp -o pj_links.o
g++ -std=gnu++11 -I"/usr/share/R/include" -DNDEBUG -fPIC -Ipajeng/src/libpaje/ -I'/home/schnorr/R/x86_64-pc-linux-gnu-library/4.0/Rcpp/include'    -fpic  -g -O2 -ffile-prefix-map=/build/r-base-XqSJAD/r-base-4.0.4=. -fstack-protector-strong -Wformat -Werror=format-security -Wdate-time -D_FORTIFY_SOURCE=2 -g  -c pj_states.cpp -o pj_states.o
g++ -std=gnu++11 -I"/usr/share/R/include" -DNDEBUG -fPIC -Ipajeng/src/libpaje/ -I'/home/schnorr/R/x86_64-pc-linux-gnu-library/4.0/Rcpp/include'    -fpic  -g -O2 -ffile-prefix-map=/build/r-base-XqSJAD/r-base-4.0.4=. -fstack-protector-strong -Wformat -Werror=format-security -Wdate-time -D_FORTIFY_SOURCE=2 -g  -c pj_variables.cpp -o pj_variables.o
g++ -std=gnu++11 -shared -L/usr/lib/R/lib -Wl,-z,relro -o pajengr.so RcppExports.o pj_dump.o pj_events.o pj_links.o pj_states.o pj_variables.o libpaje.a -L/usr/lib/R/lib -lR
#+end_example

Contents of the REad-and-delete-me file:

#+BEGIN_EXAMPLE
- Edit the help file skeletons in 'man', possibly combining help files for multiple functions.
- Edit the exports in 'NAMESPACE', and add necessary imports.
- Put any C/C++/Fortran code in 'src'.
- If you have compiled code, add a useDynLib() directive to 'NAMESPACE'.
- Run R CMD build to build the package tarball.
- Run R CMD check to check the package tarball.
#+END_EXAMPLE

And then, test to verify if the installation is working.

#+begin_src R :results output :exports both :session
library(pajengr)
suppressMessages(library(tidyverse))
pajeng_read("../pajeng/traces/simu-mardi.trace") -> x;
lapply(x, object.size)
x$container %>% as_tibble()
x$state %>% as_tibble()
x$variable %>% as_tibble()
x$event %>% as_tibble()
x$link %>% as_tibble()
#+end_src

#+RESULTS:
#+begin_example

$container
40472 bytes

$state
606408 bytes

$variable
49560 bytes

$event
2760 bytes

$link
75024 bytes

# A tibble: 307 x 7
   Nature    Parent       Type   Start   End Duration Container                
   <fct>     <fct>        <fct>  <dbl> <dbl>    <dbl> <fct>                    
 1 Container NULL         0          0  1205     1205 0                        
 2 Container 0            L1         0  1205     1205 my_cluster_1             
 3 Container my_cluster_1 ROUTER     0  1205     1205 nodemy_cluster_1_router  
 4 Container my_cluster_1 LINK       0  1205     1205 my_cluster_1_link_32_UP  
 5 Container my_cluster_1 LINK       0  1205     1205 my_cluster_1_link_31_DOWN
 6 Container my_cluster_1 LINK       0  1205     1205 my_cluster_1_link_31_UP  
 7 Container my_cluster_1 LINK       0  1205     1205 my_cluster_1_link_30_DOWN
 8 Container my_cluster_1 LINK       0  1205     1205 my_cluster_1_link_30_UP  
 9 Container my_cluster_1 LINK       0  1205     1205 my_cluster_1_link_29_DOWN
10 Container my_cluster_1 LINK       0  1205     1205 my_cluster_1_link_29_UP  
# ... with 297 more rows

# A tibble: 13,620 x 8
   Nature Container Type  Start   End Duration Imbrication Value 
   <fct>  <fct>     <fct> <dbl> <dbl>    <dbl>       <int> <fct> 
 1 State  node32    PM      100   222      122           0 normal
 2 State  node32    PM      222   256       34           0 normal
 3 State  node32    PM      256   268       12           0 normal
 4 State  node32    PM      268   291       23           0 normal
 5 State  node32    PM      291   303       12           0 normal
 6 State  node32    PM      303   425      122           0 normal
 7 State  node32    PM      425   503       78           0 normal
 8 State  node32    PM      503   515       12           0 normal
 9 State  node32    PM      515   538       23           0 normal
10 State  node32    PM      538   554       16           0 normal
# ... with 13,610 more rows

# A tibble: 507 x 7
   Nature   Container                 Type      Start   End Duration   Value
   <fct>    <fct>                     <fct>     <dbl> <dbl>    <dbl>   <dbl>
 1 Variable my_cluster_1_link_32_UP   bandwidth     0  1205     1205 1.25e+8
 2 Variable my_cluster_1_link_32_UP   latency       0  1205     1205 5.00e-5
 3 Variable my_cluster_1_link_31_DOWN bandwidth     0  1205     1205 1.25e+8
 4 Variable my_cluster_1_link_31_DOWN latency       0  1205     1205 5.00e-5
 5 Variable my_cluster_1_link_31_UP   bandwidth     0  1205     1205 1.25e+8
 6 Variable my_cluster_1_link_31_UP   latency       0  1205     1205 5.00e-5
 7 Variable my_cluster_1_link_30_DOWN bandwidth     0  1205     1205 1.25e+8
 8 Variable my_cluster_1_link_30_DOWN latency       0  1205     1205 5.00e-5
 9 Variable my_cluster_1_link_30_UP   bandwidth     0  1205     1205 1.25e+8
10 Variable my_cluster_1_link_30_UP   latency       0  1205     1205 5.00e-5
# ... with 497 more rows

# A tibble: 0 x 5
# ... with 5 variables: Nature <fct>, Container <fct>, Type <fct>, Start <dbl>,
#   Value <fct>

# A tibble: 405 x 10
   Nature Container Type  Start   End Duration Value StartContainer EndContainer
   <fct>  <fct>     <fct> <dbl> <dbl>    <dbl> <fct> <fct>          <fct>       
 1 State  my_clust… L1-L…     0     0        0 G     my_cluster_1_… node21      
 2 State  my_clust… L1-L…     0     0        0 G     my_cluster_1_… node22      
 3 State  my_clust… L1-L…     0     0        0 G     my_cluster_1_… node23      
 4 State  my_clust… L1-L…     0     0        0 G     my_cluster_1_… node24      
 5 State  my_clust… L1-L…     0     0        0 G     my_cluster_1_… node25      
 6 State  my_clust… L1-L…     0     0        0 G     my_cluster_1_… node26      
 7 State  my_clust… L1-L…     0     0        0 G     my_cluster_1_… node27      
 8 State  my_clust… L1-L…     0     0        0 G     my_cluster_1_… node28      
 9 State  my_clust… L1-L…     0     0        0 G     my_cluster_1_… node29      
10 State  my_clust… L1-L…     0     0        0 G     my_cluster_1_… node30      
# ... with 395 more rows, and 1 more variable: Key <fct>
#+end_example

Test exception handling

#+begin_src R :results output :exports both :session
library(pajengr)
suppressMessages(library(tidyverse))
pajeng_read("./traces/starpu.buggy.trace")
#+end_src

#+RESULTS:
: 
: PajeContainerException: Unknown container 'mm0' in (Line: 377, Fields: '5, Contents: '6 0.000000000 mm0 use 0.000000')
: list()




